# parameters
nc: 1  # number of classes
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.00  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]   # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  # Two Stream
  [
    ######### TransformerBlock One #############
    # stream one
    [-1, 1, InitConv, [64, 3, 2]],    # 0-P1/2  conv-3 s=2 3/64 
    [-1, 1, Conv, [128, 3, 2]], # 1-P2/4        conv-3 s=2 64/128
    [-1, 3, C2f, [128,True]],   # 2-P2/4
    [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8       conv-3 s=2 128/256
    [-1, 9, C2f, [256,True]],   # 4-P3/8
    # stream two
    [-4, 1, InitConv1, [64, 3, 2]],    # 5-P1/2
    [-1, 1, Conv, [128, 3, 2]], # 6-P2/4
    [-1, 3, C2f, [128,True]],   # 7-P2/4
    [-1, 1, Conv, [256, 3, 2]],  # 8-P3/8
    [-1, 9, C2f, [256,True]],   # 9-P3/8

    
    ######### TransformerBlock Two #############
   # transformer fusion
    [[4,9], 1, transfusionLayer3, [256,8,1]],   # 10-P3/8  args=[dim, head, depth]
    [[4,10], 1, Add2, [256,0]],    # 11-P3/8 stream one x+trans[0]
    [[9,10], 1, Add2, [256,1]],    # 12-P3/8 stream two x+trans[1]


   ######### TransformerBlock Three #############
   # stream one
    [11, 1, Conv, [512, 3, 2]],   # 13-P4/16
    [-1, 9, C2f, [512,True]],   # 14-P4/16
   # stream two
    [12, 1, Conv, [512, 3, 2]],   # 15-P4/16
    [-1, 9, C2f, [512,True]],   # 16-P4/16

   # transformer fusion
    [[14,16], 1, transfusionLayer3, [512, 8, 1]], # 17
    [[14,17], 1, Add2, [512,0]],    # 18-P3/8 stream one x+trans[0]
    [[16,17], 1, Add2, [512,1]],    # 19-P3/8 stream two x+trans[1]


    ######### TransformerBlock Four #############
    # stream one
    [18, 1, Conv, [1024, 3, 2]],    # 20-P5/32
    [-1, 1, SPPF, [1024, 5]],   # 21-P5/32
    [-1, 3, C2f, [1024, False]],   # 22-P5/32
    # stream two
    [19, 1, Conv, [1024, 3, 2]],    # 23-P5/32
    [-1, 1, SPPF, [1024, 5]],   # 24-P5/32
    [-1, 3, C2f, [1024, False]],   # 25-P5/32

    # transformer fusion
    [[22,25], 1, transfusionLayer3, [1024, 8, 1]], # 26
    [[22,26], 1, Add2, [1024,0]],    # 27-P5/32 stream one x+trans[0]
    [[25,26], 1, Add2, [1024,1]],    # 28-P5/32 stream two x+trans[1]


    ######### Add Block #############
    [[11,12], 1, Add, [1]],   # 29-P3/8 fusion backbone P3
    [[18,19], 1, Add, [1]],   # 30-P4/16 fusion backbone P4
    [[27,28], 1, Add, [1]],   # 31-P5/32 fusion backbone P5

  ]


# YOLOv5 head
head:
  [
    [-1, 1, Conv, [512, 1, 1]],   # 32
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 33
    [[-1,30], 1, Concat, [1]],    # 34 cat backbone P4
    [-1, 3, C2f, [512]],    # 35

    [-1, 1, Conv, [256, 1, 1]],   # 36
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],   # 37
    [[-1,29], 1, Concat, [1]],    # 38 cat backbone P3
    [-1, 3, C2f, [256]],    # 39 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],   # 40
    [[-1,36], 1, Concat, [1]],    # 41 cat head P4
    [-1, 3, C2f, [512]],    # 42 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],    # 43
    [[-1,31], 1, Concat, [1]],     # 44 cat head P5
    [-1, 3, C2f, [1024]],     # 45 (P5/32-large)

    [[39, 42, 45], 1, Detect, [nc]],   # Detect(P3, P4, P5)
  ]
